spec/fixtures/stripe_webhook-customer.subscription.updated-canceled.json

{
  "id": "evt_0Tb64qm0T0GBfX0vmK28R0SW",
  "object": "event",
  "api_version": "2025-01-27.acacia",
  "created": 1779744623,
  "data": {
    "object": {
      "id": "sub_0Tb5lYm0T0GBfX0vaZSYvmP7",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "disabled_reason": null,
        "enabled": false,
        "liability": null
      },
      "billing_cycle_anchor": 1779743428,
      "billing_cycle_anchor_config": null,
      "billing_mode": {
        "flexible": null,
        "type": "classic"
      },
      "billing_thresholds": null,
      "cancel_at": 1782421828,
      "cancel_at_period_end": true,
      "canceled_at": 1779744622,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": "cancellation_requested"
      },
      "collection_method": "charge_automatically",
      "created": 1779743428,
      "currency": "cad",
      "current_period_end": 1782421828,
      "current_period_start": 1779743428,
      "customer": "cus_UaGI8kzzem4k8S",
      "customer_account": null,
      "days_until_due": null,
      "default_payment_method": "pm_0Tb5lYm0T0GBfX0vM66HyQMm",
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "ended_at": null,
      "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
          "type": "self"
        }
      },
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_UaGI1JmThIHBM4",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1779743429,
            "current_period_end": 1782421828,
            "current_period_start": 1779743428,
            "discounts": [],
            "metadata": {},
            "plan": {
              "id": "price_0Qs5rim0T0GBfX0vJClxbae3",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 499,
              "amount_decimal": "499",
              "billing_scheme": "per_unit",
              "created": 1739466378,
              "currency": "cad",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "product": "prod_Rld50xInuW3d5A",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_0Qs5rim0T0GBfX0vJClxbae3",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1739466378,
              "currency": "cad",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_Rld50xInuW3d5A",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 499,
              "unit_amount_decimal": "499"
            },
            "quantity": 1,
            "subscription": "sub_0Tb5lYm0T0GBfX0vaZSYvmP7",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_0Tb5lYm0T0GBfX0vaZSYvmP7"
      },
      "latest_invoice": "in_0Tb5lYm0T0GBfX0vEG2HDzto",
      "livemode": false,
      "managed_payments": {
        "enabled": false
      },
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": {
          "acss_debit": null,
          "bancontact": null,
          "card": {
            "network": null,
            "request_three_d_secure": "automatic"
          },
          "customer_balance": null,
          "konbini": null,
          "payto": null,
          "pix": null,
          "sepa_debit": null,
          "upi": null,
          "us_bank_account": null
        },
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_0Qs5rim0T0GBfX0vJClxbae3",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 499,
        "amount_decimal": "499",
        "billing_scheme": "per_unit",
        "created": 1739466378,
        "currency": "cad",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "meter": null,
        "nickname": null,
        "product": "prod_Rld50xInuW3d5A",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1779743428,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    },
    "previous_attributes": {
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "reason": null
      }
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": "3d71bff6-29c0-4d0d-bd84-a1d8fd1adc62"
  },
  "type": "customer.subscription.updated"
}
